Repository: arahimli/lifestep_test
Catalog: ios/Runner/*.lproj/InfoPlist.strings
Languages: ru, tr

# NSAppleMusicUsageDescription
source: This permission is not needed by the app, but it is required by an underlying API. If you see this dialog, contact us.
ru: Это разрешение не требуется приложению, но оно требуется для базового API. Если вы видите это диалоговое окно, свяжитесь с нами
tr: Bu icazə proqram tərəfindən tələb olunmur, lakin əsas API tərəfindən tələb olunur. Bu dialoqu görürsünüzsə, bizimlə əlaqə saxlayın

# NSCameraUsageDescription
source: Used to change the profile image of a user
ru: Используется для изменения фото профиля пользователя
tr: İstifadəçi profili şəklini dəyişmək üçün istifadə olunur

# NSHealthShareUsageDescription
source: We will sync your data with the Apple Health app to give you better insights
ru: Мы синхронизируем ваши данные с приложением Apple Health, чтобы показывать вам фитнес статистику
tr: Sizə fitness statistikasını göstərmək üçün məlumatlarınızı Apple Health proqramı ilə sinxronlaşdırırıq

# NSHealthUpdateUsageDescription
source: We will sync your data with the Apple Health app to give you better insights
ru: Мы синхронизируем ваши данные с приложением Apple Health, чтобы показывать вам фитнес статистику
tr: Sizə fitness statistikasını göstərmək üçün məlumatlarınızı Apple Health proqramı ilə sinxronlaşdırırıq

# NSLocalizedDescription
source: Permisson is needed to provide health insights
ru: Разрешение необходимо для предоставления информации о состоянии здоровья
tr: Sağlamlıq haqqında məlumat vermək üçün icazə tələb olunur

# NSLocationWhenInUseUsageDescription
source: Lifestep needs your location to navigate you during route based challenges
ru: Lifestep нуждается в вашем местоположении, чтобы направлять во время испытаний на основе маршрута
tr: Lifestep marşrut əsaslı sınaqlar zamanı sizi naviqasiya etmək üçün məkanınıza ehtiyac var

# NSMotionUsageDescription
source: This application tracks your steps
ru: Это приложение отслеживает ваши шаги
tr: Bu proqram addımlarınızı izləyir

# NSPhotoLibraryUsageDescription
source: Used to change the profile image of a user
ru: Используется для изменения фото профиля пользователя
tr: İstifadəçi profili şəklini dəyişmək üçün istifadə olunur

# NSUserTrackingUsageDescription
source: This identifier will be used to deliver personalized ads to you.
ru: Этот идентификатор будет использоваться для показа вам персонализированной рекламы
tr: Bu ID sizə fərdiləşdirilmiş reklamları göstərmək üçün istifadə olunacaq

# NSFaceIDUsageDescription
source: We use face id for authentication
ru: Мы используем Face ID для аутентификации
tr: Doğrulama üçün Face ID istifadə edirik

# NSMicrophoneUsageDescription
source: Microphone doesn't used anyway
tr: Mikrofon onsuz da istifadə olunmur
